# 딕셔너리

# 081.
valid_score = []
scores = [8.8,8.9,8.7,9.2,9.3,9.7,9.9,9.5,7.8,9.4]
*scores,_,_ = scores
valid_score = scores

# 082.
scores = [8.8,8.9,8.7,9.2,9.3,9.7,9.9,9.5,7.8,9.4]
_,_,*scores = scores
valid_score = scores

# 083.
scores = [8.8,8.9,8.7,9.2,9.3,9.7,9.9,9.5,7.8,9.4]
_,*scores,_ = scores
valid_score = scores

# 084.
temp = {}

# 085.
아이스크림 = {"메로나":1000,"폴라포":1200,"빵빠레":1800}

# 086.
아이스크림["죠스바"] = 1200
아이스크림["월드콘"] = 1500

# 087.
ice = {"메로나":1000,"폴라포":1200,"빵빠레":1800,"죠스바":1200,"월드콘":1500}
print("메로나 가격 :",ice["메로나"])

# 088.
ice = {"메로나":1000,"폴라포":1200,"빵빠레":1800,"죠스바":1200,"월드콘":1500}
ice["메로나"] = 1300

# 089.
ice = {"메로나":1000,"폴라포":1200,"빵빠레":1800,"죠스바":1200,"월드콘":1500}
del ice["메로나"]

# 090.
# 오류가 난 이유
# 키는 입력 했지만 값을 입력하지 않아서

