# 반복문

# 131.
# 예상 결과
# 사과
# 귤
# 수박

# 132.
# #####
# #####
# #####

# 133.
변수 = "A"
print(변수)
변수 = "B"
print(변수)
변수 = "C"
print(변수)

# 134.
변수 = "A"
print("출력 :",변수)
변수 = "B"
print("출력 :",변수)
변수 = "C"
print("출력 :",변수)

# 135.
변수 = "A"
b = 변수.lower()
print("변환 :",변수)
변수 = "B"
b = 변수.lower()
print("변환 :",변수)
변수 = "C"
b = 변수.lower()
print("변환 :",변수)

# 136.
for 변수 in [10,20,30] :
    print(변수)

# 137.
for 변수 in [10,20,30] :
    print(변수)

# 138.
for 변수 in [10,20,30] :
    print(변수)
    print("-------")

# 139.
print("++++")
for 변수 in [10,20,30] :
    print(변수)

# 140.
for 변수 in range(4) :
    print("-------")
